app/views/groups/index.html.erb

    <div class="left bullet ctext">
      <%= link_to group.groupname, group %>
---
SELECT "groups".* FROM "groups"