app/views/groups/show.html.erb

SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
<% if current_user.group == @group || current_user.admin%>