app/views/users/add_to_group.html.erb

  <%= f.label :group %>
  <%= f.select :group_id, @groups.collect { |p| [p.groupname, p.id]}, {}, prompt: 'group'%>
---
SELECT "groups".* FROM "groups"