app/views/users/dashboardU.html.erb

<%# add link to user group's projects %>
  <h2>Group: <%=@user.group.groupname if @user.group%> <%= "No group" if !@user.group%></h2>
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  <% if @user.group%>
    <% @group.projects.each do |project| %>
---
SELECT "projects".* FROM "projects" WHERE "projects"."group_id" = ?  [["group_id", 1]]