app/views/users/show.html.erb

SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  <br>
  <strong><%= @user.group.groupname if @user.group%></strong>