app/views/projects/_form.html.erb

    <%= form.label :group %>
    <%= form.select :group_id, @groups.collect { |p| [p.groupname, p.id]}, {}, prompt: 'group'%>
---
SELECT "groups".* FROM "groups"