app/views/projects/index.html.erb

        <td><%= project.enddate%></td>
        <td><%= project.group.groupname if project.group%></td>
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]