app/views/projects/show.html.erb

  <strong>Group:</strong>
  <%= @project.group.groupname %>
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]