app/controllers/groups_controller.rb

SELECT "groups".* FROM "groups"
---
  def index
    @Groups = Group.all

SELECT "users".* FROM "users"
---
  def new
    @Users = User.all

INSERT INTO "groups" ("groupname", "created_at", "updated_at") VALUES (?, ?, ?)  [["groupname", nil], ["created_at", "2022-04-18 01:50:26.889639"], ["updated_at", "2022-04-18 01:50:26.889639"]]
---
  def create
    @group = Group.new(group_params)
    if @group.save

DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    Group.find(params[:id]).destroy

SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "groups" SET "groupname" = ?, "updated_at" = ? WHERE "groups"."id" = ?  [["groupname", "groupname"], ["updated_at", "2022-04-18 20:52:00.877312"], ["id", 4]]
---
  def update
    @group = Group.find(params[:id])
    if @group.update(group_params2)