app/controllers/projects_controller.rb

SELECT "groups".* FROM "groups"
---
  def new
    @project = Project.new
    @groups = Group.all

SELECT "groups".* FROM "groups"
---
  def edit
    @groups = Group.all

INSERT INTO "projects" ("projectname", "projectdescription", "startdate", "enddate", "created_at", "updated_at", "group_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save

UPDATE "projects" SET "projectname" = ?, "projectdescription" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["projectname", "newname"], ["projectdescription", "ssss"], ["updated_at", "2022-04-18 01:39:58.285968"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @project.update(project_params)