app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)

    respond_to do |format|
      if @review.save
---
INSERT INTO "reviews" ("created_at", "updated_at", "comment", "score", "project_id", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2022-04-19 18:08:20.741219"], ["updated_at", "2022-04-19 18:08:20.741219"], ["comment", "noo"], ["score", 6], ["project_id", 1], ["user_id", 2]]

  def update
    respond_to do |format|
      if @review.update(review_params)
---
UPDATE "reviews" SET "updated_at" = ?, "comment" = ?, "score" = ? WHERE "reviews"."id" = ?  [["updated_at", "2022-04-21 02:12:17.188656"], ["comment", "you good"], ["score", 10], ["id", 6]]

  def proj
    @reviews = Review.where(project_id: params[:id])
    @reviews = @reviews.where(user_id: current_user.id)
    @project = Project.find(params[:id])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."project_id" = ? AND "reviews"."user_id" = ? LIMIT ?  [["project_id", 1], ["user_id", 1], ["LIMIT", 1]]
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]