app/controllers/users_controller.rb

  def index
    @Users = User.all
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("admin", "name", "email", "password_digest", "created_at", "updated_at", "group_id") VALUES (?, ?, ?, ?, ?, ?, ?)

  def add_to_group
    @user = User.find(params[:id])
    @groups = Group.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]
SELECT "groups".* FROM "groups"

  def update_group
    @user = User.find(params[:id])
    @group = Group.find(params[:user][:group_id])
    if @user.update(update_group_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "group_id" = ? WHERE "users"."id" = ?  [["updated_at", "2022-04-18 20:28:58.602785"], ["group_id", 4], ["id", 26]]

  def dashboardU
    @user = current_user
    @group = @user.group
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]