app/views/reviews/_form.html.erb

SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."group_id" = ?  [["group_id", 1]]
---
    <div class="flex-child"><%= form.label :user %></div>
    <div class="flex-child"><%= form.select :user_id, current_user.group.users.collect { |p| [p.name, p.id]}, {}, prompt: 'user'%></div>

SELECT "projects".* FROM "projects" WHERE "projects"."group_id" = ?  [["group_id", 1]]
---
    <div class="flex-child"><%= form.label :projects %></div>
    <div class="flex-child"><%= form.select :project_id, current_user.group.projects.collect { |p| [p.projectname, p.id]}, {}, prompt: 'user'%></div>