app/views/reviews/index.html.erb

<div id="reviews">
  <% if Review.all %>
    <% Review.all.each do |review|%>
---
SELECT "reviews".* FROM "reviews"