app/views/reviews/index.html.erb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
      <tr>
        <td><%= review.project.group.groupname %></td>